// 0 Створити числовий масив та проініціалізувати його (*випадковими числами).
const myRandomNumbers = [1, 3, 5, 7, 9];
// 1 Видалити останній і початковий елемент з масиву,
myRandomNumbers.pop();
myRandomNumbers.shift();
// додати елемент до початку і кінця.
myRandomNumbers.unshift("firs new");
myRandomNumbers.push("last new");
console.log("object :>> ", myRandomNumbers);
// 2 Вивести розмір масиву.
console.log("the length of array is:>> ", myRandomNumbers.length);
// 3 Зробити копію масиву.
const copyMyRandomNumbers = [...myRandomNumbers];
// // Не використовувати методи перебору масивів (forEach, filter, map, findIndex), а використати цикли

// 4 Вивести елементи з парними індексами.
function isEvenIndex(k) {
  for (key in k) {
    k++;
  }
  return k[key];
}
console.log(isEvenIndex(copyMyRandomNumbers));
// 5 Вивести лише парні елементи (парні числа діляться на 2 без залишку).
// 6 Вивести індекси нульових елементів (елемент дорівнює нулю).
// 7 Підрахувати кількість нульових елементів.

// // Методи перебору масивів (forEach, filter, map, findIndex, *some, *every).
// 8 Отримати новий масив із заданого, який міститиме лише ненульові числа (-1, 5, 0, 9, -10 => -1, 5, 9, -10).
// 9 Отримати новий масив їх заданого, який міститиме всі елементи вихідного, поділені на 100 (99, 5, 0, 9, 30 => 0.99, 0.05, 0, 0.09, 0.3).
// 10 Вивести елементи масиву, зведені у куб.
// 11 Визначити індекс елемента, квадрат якого дорівнює 100, і видалити його, або видати діагностичне повідомлення, якщо такого елементу не існує.
// 12 *Перевірити, чи всі елементи масиву є парними числами (* або простими числами).
// 13 *Перевірити, чи є у масиві бодай один від'ємний елемент.
